it/src/AccumulationRegisters/РазмещениеОбъектов/РазмещениеОбъектов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>РазмещениеОбъектов</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ПризнакУчета</name>
    <type>
      <types>EnumRef.ПризнакУчетаПрограмм</types>
    </type>
  </attributes>
  <dimensions>
    <name>ИдентификаторДомена</name>
    <type>
      <types>CatalogRef.ИдентификаторыДоменов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИдентификаторКомпьютера</name>
    <type>
      <types>CatalogRef.ОсновныеСредства</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИдентификаторПрограммы</name>
    <type>
      <types>CatalogRef.ИдентификаторыПрограмм</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОбъектКомпьютера</name>
    <type>
      <types>CatalogRef.ОбъектыКомпьютера</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

it/src/InformationRegisters/ПоддержкаЛицензий/ПоддержкаЛицензий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПоддержкаЛицензий</name>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>СрокДействия_Месяц</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Стоимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОсновноеСредство</name>
    <type>
      <types>CatalogRef.ОсновныеСредства</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

it/src/CommonForms/ПолучениеДанныхОЗакупках/Module.bsl
&НаСервере
// Функция помещает результаты подбора в хранилище
//
Функция ЗаписатьПодборВХранилище() 
	
	СтруктураТаблиц = Новый Структура;
	СтруктураТаблиц.Вставить("ТаблицаНеобходимыхЛицензий", 		ТаблицаНеобходимыхЛицензий.Выгрузить());
	СтруктураТаблиц.Вставить("ТаблицаНеобходимойПоддержки", 	ТаблицаНеобходимойПоддержки.Выгрузить());
	
	Возврат ПоместитьВоВременноеХранилище(СтруктураТаблиц);
	
КонецФункции

&НаКлиенте
//Процедура - обработчик нажатия кнопки ОК.
//
Процедура ОК(Команда)
	
	АдресЗапасовВХранилище = ЗаписатьПодборВХранилище();
	
	Закрыть(АдресЗапасовВХранилище);
	
КонецПроцедуры // ОК()

&НаСервере
Процедура СформироватьДанныеПоЛицензиямНаСервере()

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВложенныйЗапрос.ИдентификаторПрограммы КАК Наименование,
	               |	ВложенныйЗапрос.НеобходимоеКоличество КАК Количество,
	               |	ВложенныйЗапрос.Программа
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		ВложенныйЗапрос.ИдентификаторПрограммы КАК ИдентификаторПрограммы,
	               |		СУММА(1) КАК НеобходимоеКоличество,
	               |		ВложенныйЗапрос.Программа КАК Программа
	               |	ИЗ
	               |		(ВЫБРАТЬ
	               |			РазмещениеОбъектовОстатки.ИдентификаторКомпьютера КАК ОсновноеСредство,
	               |			РазмещениеОбъектовОстатки.ОбъектКомпьютера.ШаблонСоответствия.ИдентификаторПрограммы КАК ИдентификаторПрограммы,
	               |			РазмещениеОбъектовОстатки.ОбъектКомпьютера.ШаблонСоответствия.ИдентификаторПрограммы КАК Программа
	               |		ИЗ
	               |			РегистрНакопления.РазмещениеОбъектов.Остатки КАК РазмещениеОбъектовОстатки
	               |		
	               |		СГРУППИРОВАТЬ ПО
	               |			РазмещениеОбъектовОстатки.ОбъектКомпьютера.ШаблонСоответствия.ИдентификаторПрограммы,
	               |			РазмещениеОбъектовОстатки.ИдентификаторКомпьютера,
	               |			РазмещениеОбъектовОстатки.ОбъектКомпьютера.ШаблонСоответствия.ИдентификаторПрограммы) КАК ВложенныйЗапрос
	               |	
	               |	СГРУППИРОВАТЬ ПО
	               |		ВложенныйЗапрос.ИдентификаторПрограммы,
	               |		ВложенныйЗапрос.Программа) КАК ВложенныйЗапрос
	               |ГДЕ
	               |	ВложенныйЗапрос.ИдентификаторПрограммы В(&СписокИдентификаторПрограммы)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ПоддержкаЛицензий.ОсновноеСредство КАК НаименованиеЛицензии,
	               |	ДОБАВИТЬКДАТЕ(ПоддержкаЛицензий.ДатаНачала, МЕСЯЦ, ПоддержкаЛицензий.СрокДействия_Месяц) КАК ДатаНачала,
	               |	ПоддержкаЛицензий.ОсновноеСредство.ИдентификаторПрограммы КАК Программа
	               |ИЗ
	               |	РегистрСведений.ПоддержкаЛицензий КАК ПоддержкаЛицензий
	               |ГДЕ
	               |	ДОБАВИТЬКДАТЕ(ПоддержкаЛицензий.ДатаНачала, МЕСЯЦ, ПоддержкаЛицензий.СрокДействия_Месяц) <= &ДатаАнализа";
	Запрос.УстановитьПараметр("Организация",Организация);
	Запрос.УстановитьПараметр("ДатаАнализа",ДатаАнализа);
	Запрос.УстановитьПараметр("СписокИдентификаторПрограммы",ТаблицаНастройкиПоПолученияЛицензий.Выгрузить());
	
	МассивТаблицЗакупок = Запрос.ВыполнитьПакет();
	
	ТаблицаНеобходимыхЛицензий.Загрузить(МассивТаблицЗакупок[0].Выгрузить());
	ТаблицаНеобходимойПоддержки.Загрузить(МассивТаблицЗакупок[1].Выгрузить());
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьДанныеПоПлану(Команда)

	СформироватьДанныеПоЛицензиямНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ДатаАнализа") Тогда
		ДатаАнализа = Параметры.ДатаАнализа;
	Иначе
		ДатаАнализа = ТекущаяДата();
	КонецЕсли;
	
	Если Параметры.Свойство("Организация") Тогда
		Организация = Параметры.Организация;
	Иначе
		Организация = Справочники.Организации.ПустаяСсылка();
	КонецЕсли;
	
КонецПроцедуры
